Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20J16A.PIC
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="SHCSR" edc:nzwidth="0x20" edc:access="----------------n---------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000" edc:_addr="0xE000ED24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:nzwidth="0x1" edc:desc="no description available"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE000ED28"/>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="DFSR" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0xE000ED30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="HALTED" edc:nzwidth="0x1" edc:desc="Halt request debug event active"/>
            <edc:SFRFieldDef edc:cname="BKPT" edc:nzwidth="0x1" edc:desc="Breakpoint debug event"/>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:nzwidth="0x1" edc:desc="DWT debug event"/>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:nzwidth="0x1" edc:desc="Vector catch debug event"/>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:nzwidth="0x1" edc:desc="EDBGRQ debug event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x5C" edc:_addr="0xE000ED34"/>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="TYPE" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0xE000ED90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:nzwidth="0x1" edc:desc="Separate instruction and Data Memory MapsRegions"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:nzwidth="0x8" edc:desc="Number of Data Regions"/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:nzwidth="0x8" edc:desc="Number of Instruction Regions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="CTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0xE000ED94">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="MPU Enable"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:nzwidth="0x1" edc:desc="Enable Hard Fault and NMI handlers"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:nzwidth="0x1" edc:desc="Enables privileged software access to default memory map"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RNR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE000ED98">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x8" edc:desc="Region referenced by RBAR and RASR"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED9C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x4" edc:desc="Region number"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Region number valid"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1B" edc:desc="Region base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="RASR" edc:nzwidth="0x20" edc:access="---n-nnn--nnnnnnnnnnnnnn--nnnnnn" edc:impl="0x173FFF3F" edc:_addr="0xE000EDA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Region Enable"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x5" edc:desc="Region Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:nzwidth="0x8" edc:desc="Sub-region disable"/>
            <edc:SFRFieldDef edc:cname="B" edc:nzwidth="0x1" edc:desc="Bufferable bit"/>
            <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Cacheable bit"/>
            <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="Shareable bit"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:nzwidth="0x3" edc:desc="TEX bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x3" edc:desc="Access Permission"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never Attribute"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="SCS" edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="PERIPHERALS" edc:beginaddr="0x40000000" edc:endaddr="0x4800001C" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="WRCTRL" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x40000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x10" edc:desc="Peripheral identifier"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Peripheral access control key">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:nzwidth="0x1" edc:desc="Peripheral acess error event output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000005"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000009">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGAHB" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:nzwidth="0x1" edc:desc="FLASH"/>
            <edc:SFRFieldDef edc:cname="HSRAMCM0P_" edc:nzwidth="0x1" edc:desc="HSRAMCM0P"/>
            <edc:SFRFieldDef edc:cname="HSRAMDSU_" edc:nzwidth="0x1" edc:desc="HSRAMDSU"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:nzwidth="0x1" edc:desc="HPB1"/>
            <edc:SFRFieldDef edc:cname="HPB0_" edc:nzwidth="0x1" edc:desc="HPB0"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:nzwidth="0x1" edc:desc="HPB2"/>
            <edc:SFRFieldDef edc:cname="LPRAMDMAC_" edc:nzwidth="0x1" edc:desc="LPRAMDMAC"/>
            <edc:SFRFieldDef edc:cname="DIVAS_" edc:nzwidth="0x1" edc:desc="DIVAS"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
