Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20J16A.PIC
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="COMPCTRL2" edc:nzwidth="0x20" edc:access="--nn-nnn----n-nnnnnn-nnn-n-nnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x370BF75E" edc:_addr="0x42005018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="SINGLE" edc:nzwidth="0x1" edc:desc="Single-Shot Mode"/>
            <edc:SFRFieldDef edc:cname="INTSEL" edc:nzwidth="0x2" edc:desc="Interrupt Selection">
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="Interrupt on comparator output toggle" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on comparator output rising" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on comparator output falling" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EOC" edc:desc="Interrupt on end of comparison (single-shot mode only)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x3" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD scaler" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Internal bandgap voltage" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x3" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD Scaler" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWAP" edc:nzwidth="0x1" edc:desc="Swap Inputs and Invert"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Selection">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low speed" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High speed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HYSTEN" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FLEN" edc:nzwidth="0x3" edc:desc="Filter Length">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No filtering" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAJ3" edc:desc="3-bit majority function (2 of 3)" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MAJ5" edc:desc="5-bit majority function (3 of 5)" edc:when="(field &amp; 0x7) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT" edc:nzwidth="0x2" edc:desc="Output">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The output of COMPn is not routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="The asynchronous output of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="COMPCTRL3" edc:nzwidth="0x20" edc:access="--nn-nnn----n-nnnnnn-nnn-n-nnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x370BF75E" edc:_addr="0x4200501C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="SINGLE" edc:nzwidth="0x1" edc:desc="Single-Shot Mode"/>
            <edc:SFRFieldDef edc:cname="INTSEL" edc:nzwidth="0x2" edc:desc="Interrupt Selection">
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="Interrupt on comparator output toggle" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on comparator output rising" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on comparator output falling" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EOC" edc:desc="Interrupt on end of comparison (single-shot mode only)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x3" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD scaler" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Internal bandgap voltage" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x3" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD Scaler" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWAP" edc:nzwidth="0x1" edc:desc="Swap Inputs and Invert"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Selection">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low speed" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High speed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HYSTEN" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FLEN" edc:nzwidth="0x3" edc:desc="Filter Length">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No filtering" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAJ3" edc:desc="3-bit majority function (2 of 3)" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MAJ5" edc:desc="5-bit majority function (3 of 5)" edc:when="(field &amp; 0x7) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT" edc:nzwidth="0x2" edc:desc="Output">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The output of COMPn is not routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="The asynchronous output of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x42005020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINCTRL" edc:nzwidth="0x1" edc:desc="WINCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL0" edc:nzwidth="0x1" edc:desc="COMPCTRL 0 Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL1" edc:nzwidth="0x1" edc:desc="COMPCTRL 1 Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
