Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.5.93/samc20/edc/ATSAMC20J16A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y30" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN9" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="ULPVREF_CLKP2" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y31" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN10" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="VCORERDY" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTWAKE12" edc:ppsfunction="A" ltx:memberofperipheral="RSTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="BGBUFREADY4" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTWAKE13" edc:ppsfunction="A" ltx:memberofperipheral="RSTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTWAKE14" edc:ppsfunction="A" ltx:memberofperipheral="RSTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTWAKE15" edc:ppsfunction="A" ltx:memberofperipheral="RSTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="XOUT" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y22" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y23" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT3" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y24" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y25" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="Y27" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN7" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="CMP2" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="CMP3" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET_N" edc:ppsfunction="default" ltx:memberofperipheral="PM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB30" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="CMP2" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="LDO_READY" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB31" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="CMP3" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="VREFREADY2" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB00" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB01" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="Y7" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="VREFREADY0" edc:ppsfunction="VREG" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB02" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="Y8" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB03" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="Y9" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
